const badWorksRegexps = [
  /.*ху[ёеий].*/gi,
  /.*п(и|е|ы)зд.*/gi,
  /.*бл[яею].*/gi,
  /.*уеб.*/gi,
  /.*шлюх.*/gi,
  /.*залуп.*/gi,
  /.*член.*/gi,
  /.*срака.*/gi,
  /.*задниц.*/gi,
  /.*срач.*/gi,
  /.*минет.*/gi,
  /.*дроч.*/gi,
  /.*анал.*/gi,
  /.*еб[лы].*/gi,
  /.*ёб.*/gi,
  /.*еба.*/gi,
  /.*(с|сц)уч?к(а|у|и|е|ой|ай).*/gi,
  /.*п[ие]д[оае]?р.*/gi,
  /очк[оа].*/gi,
  /.*очко.*/gi,
  /.*г[оа]вн.*/gi,
  /.*д[еи]рьм.*/gi,
  /(о|а)н(о|а)нист.*/gi,
  /^лошар.*/gi,
  /к(а|о)злина$/gi,
  /сволоч(ь|ъ|и|уга|ам|ами).*/gi,
  /^лох[уеыаоэяию].*/gi,
  /.*урод(ы|у|ам|ина|ины).*/gi,
  /.*бля(т|д).*/gi,
  /.*г[а|о]ндо.*/gi,
  /.*м(а|о)нд(а|о).*/gi,
  /.*сперма.*/gi,
  /.*[уеыаоэяию]еб$/gi,
  /^придур(ок|ки).*/gi,
  /^д(е|и)би(л|лы).*/gi,
  /.*сос(ать|и|ешь|у)$/gi,
  /^муд(е|ил|о|а|я|еб).*/gi,
  /.*шалав(а|ы|ам|е|ами).*/gi,
  /.*пр(а|о)ст(и|е)т(у|е)тк(а|и|ам|е|ами).*/gi,
  /^еб.*/gi,
  /.*(д(о|а)лб(о|а)|разъ|разь|за|вы|по)ебы*.*/gi,
  /.*хер.*/gi,
];

const politicalWords = [
  {
    regex: /путин/gi,
    answer: "Ну нельзя так",
  },
  {
    regex: /путлер/gi,
    answer: "За тобой выехали",
  },
  {
    regex: /хох(ол)|(л[ыя])/gi,
    answer: "Давай без этого",
  },
];

const goodWords = [
  "шумахер",
  "галахер",
  "банально",
  "банальность",
  "банальный",
  "канал",
  "канальный",
  "сабля",
  "саблю",
  "оглобля",
  "оглоблю",
  "дезмонда",
  "команда",
  "каманда",
  "застрахуй",
  "застрахуйте",
  "одномандатный",
  "подстрахуй",
  "подстрахуйте",
  "психуй",
  "психуйте",
  "истреблять",
  "оскорблять",
  "расслаблять",
  "расслабляя",
  "расслабляющий",
  "оскорбляя",
  "оскорбляющий",
  "употреблять",
  "потреблять",
  "истребляя",
  "употребляя",
  "потребляя",
  "истребляю",
  "употребляю",
  "потребляю",
  "расслабляю",
  "истребляющий",
  "употребляющий",
  "потребляющий",
];

export const censoredChecker = (text) => {
  if (badWorksRegexps.every((reg) => !reg.test(text))) {
    const ind = politicalWords.findIndex((i) => i.regex.test(text));
    return ind < 0 ? text : politicalWords[ind].answer;
  } else {
    if (goodWords.includes(text.toLowerCase())) {
      return text;
    } else {
      return "";
    }
  }
};
